<!-- dflook/terraform-github-actions {"workspace":"kub1k","backend_type":"local","backend":"f305f62daa697ee7dc2f2e1eba6f9ff067a4b56baf4f76c558a9e580e9b6a2b0","plan_job_ref":"Job Terraform Plan #94 at https://github.com/ironashram/kub1k/actions/runs/11597651280","plan_out_hash":"f83893ca04d229c338056165e8c32ccfcca279bc0e0149bd33ee92d6337771bf","plan_hash":"02b4c626c3eb00700a7cd92cbf971534aa06e3e178598e9dd8c59604af80af92","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform__ in the __kub1k__ workspace
<details>
<summary>Plan: 1 to add, 2 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.provision_apps[0].helm_release.cilium will be updated in-place
!~  resource "helm_release" "cilium" {
        id                         = "cilium"
        name                       = "cilium"
!~      version                    = "1.16.3" -> "1.17.0-pre.1"
#        (27 unchanged attributes hidden)
    }

  # module.provision_k3s.data.local_sensitive_file.kubeconfig will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "local_sensitive_file" "kubeconfig" {
+       content              = (sensitive value)
+       content_base64       = (sensitive value)
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       filename             = "/github/home/.kube/config-files/kub1k.yaml"
+       id                   = (known after apply)
    }

  # module.provision_k3s.null_resource.k3s_kubeconfig must be replaced
-/+ resource "null_resource" "k3s_kubeconfig" {
!~      id       = "******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "timestamp" = "2024-10-25T21:59:21Z" -> (known after apply)
        }
    }

  # module.provision_k3s.vault_kv_secret_v2.k3s will be updated in-place
!~  resource "vault_kv_secret_v2" "k3s" {
!~      data_json           = (sensitive value)
        id                  = "kv/data/kub1k/k3s"
        name                = "kub1k/k3s"
#        (6 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #94](https://github.com/ironashram/kub1k/actions/runs/11597651280)